zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lcXc-pinctrl.h
/*
 * Autogenerated file
 *
 * SPDX-License-Identifier: Apache-2.0
 */

#include <dt-bindings/pinctrl/atmel_sam_pinctrl.h>

/* pa0_gpio */
#define PA0_GPIO \
	SAM_PINMUX(a, 0, gpio, gpio)

/* pa1_gpio */
#define PA1_GPIO \
	SAM_PINMUX(a, 1, gpio, gpio)

/* pa2_gpio */
#define PA2_GPIO \
	SAM_PINMUX(a, 2, gpio, gpio)

/* pa2a_scif_gclk0 */
#define PA2A_SCIF_GCLK0 \
	SAM_PINMUX(a, 2, a, periph)

/* pa2b_spi_npcs0 */
#define PA2B_SPI_NPCS0 \
	SAM_PINMUX(a, 2, b, periph)

/* pa2g_catb_dis */
#define PA2G_CATB_DIS \
	SAM_PINMUX(a, 2, g, periph)

/* pa3_gpio */
#define PA3_GPIO \
	SAM_PINMUX(a, 3, gpio, gpio)

/* pa3b_spi_miso */
#define PA3B_SPI_MISO \
	SAM_PINMUX(a, 3, b, periph)

/* pa4_gpio */
#define PA4_GPIO \
	SAM_PINMUX(a, 4, gpio, gpio)

/* pa4a_adcife_ad0 */
#define PA4A_ADCIFE_AD0 \
	SAM_PINMUX(a, 4, a, periph)

/* pa4b_usart0_clk */
#define PA4B_USART0_CLK \
	SAM_PINMUX(a, 4, b, periph)

/* pa4c_eic_extint2 */
#define PA4C_EIC_EXTINT2 \
	SAM_PINMUX(a, 4, c, periph)

/* pa4d_gloc_in1 */
#define PA4D_GLOC_IN1 \
	SAM_PINMUX(a, 4, d, periph)

/* pa4g_catb_sense0 */
#define PA4G_CATB_SENSE0 \
	SAM_PINMUX(a, 4, g, periph)

/* pa5_gpio */
#define PA5_GPIO \
	SAM_PINMUX(a, 5, gpio, gpio)

/* pa5a_adcife_ad1 */
#define PA5A_ADCIFE_AD1 \
	SAM_PINMUX(a, 5, a, periph)

/* pa5b_usart0_rxd */
#define PA5B_USART0_RXD \
	SAM_PINMUX(a, 5, b, periph)

/* pa5c_eic_extint3 */
#define PA5C_EIC_EXTINT3 \
	SAM_PINMUX(a, 5, c, periph)

/* pa5d_gloc_in2 */
#define PA5D_GLOC_IN2 \
	SAM_PINMUX(a, 5, d, periph)

/* pa5e_adcife_trigger */
#define PA5E_ADCIFE_TRIGGER \
	SAM_PINMUX(a, 5, e, periph)

/* pa5g_catb_sense1 */
#define PA5G_CATB_SENSE1 \
	SAM_PINMUX(a, 5, g, periph)

/* pa6_gpio */
#define PA6_GPIO \
	SAM_PINMUX(a, 6, gpio, gpio)

/* pa6a_dacc_vout */
#define PA6A_DACC_VOUT \
	SAM_PINMUX(a, 6, a, periph)

/* pa6b_usart0_rts */
#define PA6B_USART0_RTS \
	SAM_PINMUX(a, 6, b, periph)

/* pa6c_eic_extint1 */
#define PA6C_EIC_EXTINT1 \
	SAM_PINMUX(a, 6, c, periph)

/* pa6d_gloc_in0 */
#define PA6D_GLOC_IN0 \
	SAM_PINMUX(a, 6, d, periph)

/* pa6e_acifc_acan0 */
#define PA6E_ACIFC_ACAN0 \
	SAM_PINMUX(a, 6, e, periph)

/* pa6g_catb_sense2 */
#define PA6G_CATB_SENSE2 \
	SAM_PINMUX(a, 6, g, periph)

/* pa7_gpio */
#define PA7_GPIO \
	SAM_PINMUX(a, 7, gpio, gpio)

/* pa7a_adcife_ad2 */
#define PA7A_ADCIFE_AD2 \
	SAM_PINMUX(a, 7, a, periph)

/* pa7b_usart0_txd */
#define PA7B_USART0_TXD \
	SAM_PINMUX(a, 7, b, periph)

/* pa7c_eic_extint4 */
#define PA7C_EIC_EXTINT4 \
	SAM_PINMUX(a, 7, c, periph)

/* pa7d_gloc_in3 */
#define PA7D_GLOC_IN3 \
	SAM_PINMUX(a, 7, d, periph)

/* pa7e_acifc_acap0 */
#define PA7E_ACIFC_ACAP0 \
	SAM_PINMUX(a, 7, e, periph)

/* pa7g_catb_sense3 */
#define PA7G_CATB_SENSE3 \
	SAM_PINMUX(a, 7, g, periph)

/* pa8_gpio */
#define PA8_GPIO \
	SAM_PINMUX(a, 8, gpio, gpio)

/* pa8a_usart0_rts */
#define PA8A_USART0_RTS \
	SAM_PINMUX(a, 8, a, periph)

/* pa8b_tc0_a0 */
#define PA8B_TC0_A0 \
	SAM_PINMUX(a, 8, b, periph)

/* pa8c_pevc_evt0 */
#define PA8C_PEVC_EVT0 \
	SAM_PINMUX(a, 8, c, periph)

/* pa8d_gloc_out0 */
#define PA8D_GLOC_OUT0 \
	SAM_PINMUX(a, 8, d, periph)

/* pa8f_lcdca_seg23 */
#define PA8F_LCDCA_SEG23 \
	SAM_PINMUX(a, 8, f, periph)

/* pa8g_catb_sense4 */
#define PA8G_CATB_SENSE4 \
	SAM_PINMUX(a, 8, g, periph)

/* pa9_gpio */
#define PA9_GPIO \
	SAM_PINMUX(a, 9, gpio, gpio)

/* pa9a_usart0_cts */
#define PA9A_USART0_CTS \
	SAM_PINMUX(a, 9, a, periph)

/* pa9b_tc0_b0 */
#define PA9B_TC0_B0 \
	SAM_PINMUX(a, 9, b, periph)

/* pa9c_pevc_evt1 */
#define PA9C_PEVC_EVT1 \
	SAM_PINMUX(a, 9, c, periph)

/* pa9d_parc_pcdata0 */
#define PA9D_PARC_PCDATA0 \
	SAM_PINMUX(a, 9, d, periph)

/* pa9f_lcdca_com3 */
#define PA9F_LCDCA_COM3 \
	SAM_PINMUX(a, 9, f, periph)

/* pa9g_catb_sense5 */
#define PA9G_CATB_SENSE5 \
	SAM_PINMUX(a, 9, g, periph)

/* pa10_gpio */
#define PA10_GPIO \
	SAM_PINMUX(a, 10, gpio, gpio)

/* pa10a_usart0_clk */
#define PA10A_USART0_CLK \
	SAM_PINMUX(a, 10, a, periph)

/* pa10b_tc0_a1 */
#define PA10B_TC0_A1 \
	SAM_PINMUX(a, 10, b, periph)

/* pa10c_pevc_evt2 */
#define PA10C_PEVC_EVT2 \
	SAM_PINMUX(a, 10, c, periph)

/* pa10d_parc_pcdata1 */
#define PA10D_PARC_PCDATA1 \
	SAM_PINMUX(a, 10, d, periph)

/* pa10f_lcdca_com2 */
#define PA10F_LCDCA_COM2 \
	SAM_PINMUX(a, 10, f, periph)

/* pa10g_catb_sense6 */
#define PA10G_CATB_SENSE6 \
	SAM_PINMUX(a, 10, g, periph)

/* pa11_gpio */
#define PA11_GPIO \
	SAM_PINMUX(a, 11, gpio, gpio)

/* pa11a_usart0_rxd */
#define PA11A_USART0_RXD \
	SAM_PINMUX(a, 11, a, periph)

/* pa11b_tc0_b1 */
#define PA11B_TC0_B1 \
	SAM_PINMUX(a, 11, b, periph)

/* pa11c_pevc_evt3 */
#define PA11C_PEVC_EVT3 \
	SAM_PINMUX(a, 11, c, periph)

/* pa11d_parc_pcdata2 */
#define PA11D_PARC_PCDATA2 \
	SAM_PINMUX(a, 11, d, periph)

/* pa11f_lcdca_com1 */
#define PA11F_LCDCA_COM1 \
	SAM_PINMUX(a, 11, f, periph)

/* pa11g_catb_sense7 */
#define PA11G_CATB_SENSE7 \
	SAM_PINMUX(a, 11, g, periph)

/* pa12_gpio */
#define PA12_GPIO \
	SAM_PINMUX(a, 12, gpio, gpio)

/* pa12a_usart0_txd */
#define PA12A_USART0_TXD \
	SAM_PINMUX(a, 12, a, periph)

/* pa12b_tc0_a2 */
#define PA12B_TC0_A2 \
	SAM_PINMUX(a, 12, b, periph)

/* pa12d_parc_pcdata3 */
#define PA12D_PARC_PCDATA3 \
	SAM_PINMUX(a, 12, d, periph)

/* pa12f_lcdca_com0 */
#define PA12F_LCDCA_COM0 \
	SAM_PINMUX(a, 12, f, periph)

/* pa12g_catb_dis */
#define PA12G_CATB_DIS \
	SAM_PINMUX(a, 12, g, periph)

/* pa13_gpio */
#define PA13_GPIO \
	SAM_PINMUX(a, 13, gpio, gpio)

/* pa13a_usart1_rts */
#define PA13A_USART1_RTS \
	SAM_PINMUX(a, 13, a, periph)

/* pa13b_tc0_b2 */
#define PA13B_TC0_B2 \
	SAM_PINMUX(a, 13, b, periph)

/* pa13c_spi_npcs1 */
#define PA13C_SPI_NPCS1 \
	SAM_PINMUX(a, 13, c, periph)

/* pa13d_parc_pcdata4 */
#define PA13D_PARC_PCDATA4 \
	SAM_PINMUX(a, 13, d, periph)

/* pa13f_lcdca_seg5 */
#define PA13F_LCDCA_SEG5 \
	SAM_PINMUX(a, 13, f, periph)

/* pa13g_catb_sense8 */
#define PA13G_CATB_SENSE8 \
	SAM_PINMUX(a, 13, g, periph)

/* pa14_gpio */
#define PA14_GPIO \
	SAM_PINMUX(a, 14, gpio, gpio)

/* pa14a_usart1_clk */
#define PA14A_USART1_CLK \
	SAM_PINMUX(a, 14, a, periph)

/* pa14b_tc0_clk0 */
#define PA14B_TC0_CLK0 \
	SAM_PINMUX(a, 14, b, periph)

/* pa14c_spi_npcs2 */
#define PA14C_SPI_NPCS2 \
	SAM_PINMUX(a, 14, c, periph)

/* pa14d_parc_pcdata5 */
#define PA14D_PARC_PCDATA5 \
	SAM_PINMUX(a, 14, d, periph)

/* pa14f_lcdca_seg6 */
#define PA14F_LCDCA_SEG6 \
	SAM_PINMUX(a, 14, f, periph)

/* pa14g_catb_sense9 */
#define PA14G_CATB_SENSE9 \
	SAM_PINMUX(a, 14, g, periph)

/* pa15_gpio */
#define PA15_GPIO \
	SAM_PINMUX(a, 15, gpio, gpio)

/* pa15a_usart1_rxd */
#define PA15A_USART1_RXD \
	SAM_PINMUX(a, 15, a, periph)

