zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lcXc-pinctrl.h
/* pa26a_usbc_dp */
#define PA26A_USBC_DP \
	SAM_PINMUX(a, 26, a, periph)

/* pa26b_usart2_txd */
#define PA26B_USART2_TXD \
	SAM_PINMUX(a, 26, b, periph)

/* pa26g_catb_sense20 */
#define PA26G_CATB_SENSE20 \
	SAM_PINMUX(a, 26, g, periph)

/* pa27_gpio */
#define PA27_GPIO \
	SAM_PINMUX(a, 27, gpio, gpio)

/* pa28_gpio */
#define PA28_GPIO \
	SAM_PINMUX(a, 28, gpio, gpio)

/* pa29_gpio */
#define PA29_GPIO \
	SAM_PINMUX(a, 29, gpio, gpio)

/* pa30_gpio */
#define PA30_GPIO \
	SAM_PINMUX(a, 30, gpio, gpio)

/* pa31_gpio */
#define PA31_GPIO \
	SAM_PINMUX(a, 31, gpio, gpio)

/* pb0_gpio */
#define PB0_GPIO \
	SAM_PINMUX(b, 0, gpio, gpio)

/* pb0a_twims1_twd */
#define PB0A_TWIMS1_TWD \
	SAM_PINMUX(b, 0, a, periph)

/* pb0b_usart0_rxd */
#define PB0B_USART0_RXD \
	SAM_PINMUX(b, 0, b, periph)

/* pb0g_catb_sense21 */
#define PB0G_CATB_SENSE21 \
	SAM_PINMUX(b, 0, g, periph)

/* pb1_gpio */
#define PB1_GPIO \
	SAM_PINMUX(b, 1, gpio, gpio)

/* pb1a_twims1_twck */
#define PB1A_TWIMS1_TWCK \
	SAM_PINMUX(b, 1, a, periph)

/* pb1b_usart0_txd */
#define PB1B_USART0_TXD \
	SAM_PINMUX(b, 1, b, periph)

/* pb1c_eic_extint0 */
#define PB1C_EIC_EXTINT0 \
	SAM_PINMUX(b, 1, c, periph)

/* pb1g_catb_sense22 */
#define PB1G_CATB_SENSE22 \
	SAM_PINMUX(b, 1, g, periph)

/* pb2_gpio */
#define PB2_GPIO \
	SAM_PINMUX(b, 2, gpio, gpio)

/* pb2a_adcife_ad3 */
#define PB2A_ADCIFE_AD3 \
	SAM_PINMUX(b, 2, a, periph)

/* pb2b_usart1_rts */
#define PB2B_USART1_RTS \
	SAM_PINMUX(b, 2, b, periph)

/* pb2c_abdacb_dac0 */
#define PB2C_ABDACB_DAC0 \
	SAM_PINMUX(b, 2, c, periph)

/* pb2d_iisc_isck */
#define PB2D_IISC_ISCK \
	SAM_PINMUX(b, 2, d, periph)

/* pb2e_acifc_acbn0 */
#define PB2E_ACIFC_ACBN0 \
	SAM_PINMUX(b, 2, e, periph)

/* pb2g_catb_sense23 */
#define PB2G_CATB_SENSE23 \
	SAM_PINMUX(b, 2, g, periph)

/* pb3_gpio */
#define PB3_GPIO \
	SAM_PINMUX(b, 3, gpio, gpio)

/* pb3a_adcife_ad4 */
#define PB3A_ADCIFE_AD4 \
	SAM_PINMUX(b, 3, a, periph)

/* pb3b_usart1_clk */
#define PB3B_USART1_CLK \
	SAM_PINMUX(b, 3, b, periph)

/* pb3c_abdacb_dacn0 */
#define PB3C_ABDACB_DACN0 \
	SAM_PINMUX(b, 3, c, periph)

/* pb3d_iisc_isdi */
#define PB3D_IISC_ISDI \
	SAM_PINMUX(b, 3, d, periph)

/* pb3e_acifc_acbp0 */
#define PB3E_ACIFC_ACBP0 \
	SAM_PINMUX(b, 3, e, periph)

/* pb3g_catb_dis */
#define PB3G_CATB_DIS \
	SAM_PINMUX(b, 3, g, periph)

/* pb4_gpio */
#define PB4_GPIO \
	SAM_PINMUX(b, 4, gpio, gpio)

/* pb4a_adcife_ad5 */
#define PB4A_ADCIFE_AD5 \
	SAM_PINMUX(b, 4, a, periph)

/* pb4b_usart1_rxd */
#define PB4B_USART1_RXD \
	SAM_PINMUX(b, 4, b, periph)

/* pb4c_abdacb_dac1 */
#define PB4C_ABDACB_DAC1 \
	SAM_PINMUX(b, 4, c, periph)

/* pb4d_iisc_isdo */
#define PB4D_IISC_ISDO \
	SAM_PINMUX(b, 4, d, periph)

/* pb4e_dacc_ext_trig0 */
#define PB4E_DACC_EXT_TRIG0 \
	SAM_PINMUX(b, 4, e, periph)

/* pb4g_catb_sense24 */
#define PB4G_CATB_SENSE24 \
	SAM_PINMUX(b, 4, g, periph)

/* pb5_gpio */
#define PB5_GPIO \
	SAM_PINMUX(b, 5, gpio, gpio)

/* pb5a_adcife_ad6 */
#define PB5A_ADCIFE_AD6 \
	SAM_PINMUX(b, 5, a, periph)

/* pb5b_usart1_txd */
#define PB5B_USART1_TXD \
	SAM_PINMUX(b, 5, b, periph)

/* pb5c_abdacb_dacn1 */
#define PB5C_ABDACB_DACN1 \
	SAM_PINMUX(b, 5, c, periph)

/* pb5d_iisc_imck */
#define PB5D_IISC_IMCK \
	SAM_PINMUX(b, 5, d, periph)

/* pb5g_catb_sense25 */
#define PB5G_CATB_SENSE25 \
	SAM_PINMUX(b, 5, g, periph)

/* pb6_gpio */
#define PB6_GPIO \
	SAM_PINMUX(b, 6, gpio, gpio)

/* pb6a_usart3_rts */
#define PB6A_USART3_RTS \
	SAM_PINMUX(b, 6, a, periph)

/* pb6c_gloc_in4 */
#define PB6C_GLOC_IN4 \
	SAM_PINMUX(b, 6, c, periph)

/* pb6d_iisc_iws */
#define PB6D_IISC_IWS \
	SAM_PINMUX(b, 6, d, periph)

/* pb6f_lcdca_seg22 */
#define PB6F_LCDCA_SEG22 \
	SAM_PINMUX(b, 6, f, periph)

/* pb6g_catb_sense26 */
#define PB6G_CATB_SENSE26 \
	SAM_PINMUX(b, 6, g, periph)

/* pb7_gpio */
#define PB7_GPIO \
	SAM_PINMUX(b, 7, gpio, gpio)

/* pb7a_usart3_cts */
#define PB7A_USART3_CTS \
	SAM_PINMUX(b, 7, a, periph)

/* pb7c_gloc_in5 */
#define PB7C_GLOC_IN5 \
	SAM_PINMUX(b, 7, c, periph)

/* pb7d_tc0_a0 */
#define PB7D_TC0_A0 \
	SAM_PINMUX(b, 7, d, periph)

/* pb7f_lcdca_seg21 */
#define PB7F_LCDCA_SEG21 \
	SAM_PINMUX(b, 7, f, periph)

/* pb7g_catb_sense27 */
#define PB7G_CATB_SENSE27 \
	SAM_PINMUX(b, 7, g, periph)

/* pb8_gpio */
#define PB8_GPIO \
	SAM_PINMUX(b, 8, gpio, gpio)

/* pb8a_usart3_clk */
#define PB8A_USART3_CLK \
	SAM_PINMUX(b, 8, a, periph)

/* pb8c_gloc_in6 */
#define PB8C_GLOC_IN6 \
	SAM_PINMUX(b, 8, c, periph)

/* pb8d_tc0_b0 */
#define PB8D_TC0_B0 \
	SAM_PINMUX(b, 8, d, periph)

/* pb8f_lcdca_seg14 */
#define PB8F_LCDCA_SEG14 \
	SAM_PINMUX(b, 8, f, periph)

/* pb8g_catb_sense28 */
#define PB8G_CATB_SENSE28 \
	SAM_PINMUX(b, 8, g, periph)

/* pb9_gpio */
#define PB9_GPIO \
	SAM_PINMUX(b, 9, gpio, gpio)

/* pb9a_usart3_rxd */
#define PB9A_USART3_RXD \
	SAM_PINMUX(b, 9, a, periph)

/* pb9b_pevd_evt2 */
#define PB9B_PEVD_EVT2 \
	SAM_PINMUX(b, 9, b, periph)

/* pb9c_gloc_in7 */
#define PB9C_GLOC_IN7 \
	SAM_PINMUX(b, 9, c, periph)

/* pb9d_tc0_a1 */
#define PB9D_TC0_A1 \
	SAM_PINMUX(b, 9, d, periph)

/* pb9f_lcdca_seg15 */
#define PB9F_LCDCA_SEG15 \
	SAM_PINMUX(b, 9, f, periph)

/* pb9g_catb_sense29 */
#define PB9G_CATB_SENSE29 \
	SAM_PINMUX(b, 9, g, periph)

/* pb10_gpio */
#define PB10_GPIO \
	SAM_PINMUX(b, 10, gpio, gpio)

/* pb10a_usart3_txd */
#define PB10A_USART3_TXD \
	SAM_PINMUX(b, 10, a, periph)

/* pb10b_pevd_evt3 */
#define PB10B_PEVD_EVT3 \
	SAM_PINMUX(b, 10, b, periph)

/* pb10c_gloc_out1 */
#define PB10C_GLOC_OUT1 \
	SAM_PINMUX(b, 10, c, periph)

/* pb10d_tc0_b1 */
#define PB10D_TC0_B1 \
	SAM_PINMUX(b, 10, d, periph)

/* pb10e_scif_gclk0 */
#define PB10E_SCIF_GCLK0 \
	SAM_PINMUX(b, 10, e, periph)

/* pb10f_lcdca_seg16 */
#define PB10F_LCDCA_SEG16 \
	SAM_PINMUX(b, 10, f, periph)

/* pb10g_catb_sense30 */
#define PB10G_CATB_SENSE30 \
	SAM_PINMUX(b, 10, g, periph)

/* pb11_gpio */
#define PB11_GPIO \
	SAM_PINMUX(b, 11, gpio, gpio)

/* pb11a_usart0_cts */
#define PB11A_USART0_CTS \
	SAM_PINMUX(b, 11, a, periph)

/* pb11b_spi_npcs2 */
#define PB11B_SPI_NPCS2 \
	SAM_PINMUX(b, 11, b, periph)

/* pb11d_tc0_a2 */
#define PB11D_TC0_A2 \
	SAM_PINMUX(b, 11, d, periph)

/* pb11e_scif_gclk1 */
#define PB11E_SCIF_GCLK1 \
	SAM_PINMUX(b, 11, e, periph)

