zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lcXc-pinctrl.h
/* pb11f_lcdca_seg17 */
#define PB11F_LCDCA_SEG17 \
	SAM_PINMUX(b, 11, f, periph)

/* pb11g_catb_sense31 */
#define PB11G_CATB_SENSE31 \
	SAM_PINMUX(b, 11, g, periph)

/* pb12_gpio */
#define PB12_GPIO \
	SAM_PINMUX(b, 12, gpio, gpio)

/* pb12a_usart0_rts */
#define PB12A_USART0_RTS \
	SAM_PINMUX(b, 12, a, periph)

/* pb12b_spi_npcs3 */
#define PB12B_SPI_NPCS3 \
	SAM_PINMUX(b, 12, b, periph)

/* pb12c_pevc_evt0 */
#define PB12C_PEVC_EVT0 \
	SAM_PINMUX(b, 12, c, periph)

/* pb12d_tc0_b2 */
#define PB12D_TC0_B2 \
	SAM_PINMUX(b, 12, d, periph)

/* pb12e_scif_gclk2 */
#define PB12E_SCIF_GCLK2 \
	SAM_PINMUX(b, 12, e, periph)

/* pb12f_lcdca_seg32 */
#define PB12F_LCDCA_SEG32 \
	SAM_PINMUX(b, 12, f, periph)

/* pb12g_catb_dis */
#define PB12G_CATB_DIS \
	SAM_PINMUX(b, 12, g, periph)

/* pb13_gpio */
#define PB13_GPIO \
	SAM_PINMUX(b, 13, gpio, gpio)

/* pb13a_usart0_clk */
#define PB13A_USART0_CLK \
	SAM_PINMUX(b, 13, a, periph)

/* pb13b_spi_npcs1 */
#define PB13B_SPI_NPCS1 \
	SAM_PINMUX(b, 13, b, periph)

/* pb13c_pevc_evt1 */
#define PB13C_PEVC_EVT1 \
	SAM_PINMUX(b, 13, c, periph)

/* pb13d_tc0_clk0 */
#define PB13D_TC0_CLK0 \
	SAM_PINMUX(b, 13, d, periph)

/* pb13e_scif_gclk3 */
#define PB13E_SCIF_GCLK3 \
	SAM_PINMUX(b, 13, e, periph)

/* pb13f_lcdca_seg33 */
#define PB13F_LCDCA_SEG33 \
	SAM_PINMUX(b, 13, f, periph)

/* pb13g_catb_sense0 */
#define PB13G_CATB_SENSE0 \
	SAM_PINMUX(b, 13, g, periph)

/* pb14_gpio */
#define PB14_GPIO \
	SAM_PINMUX(b, 14, gpio, gpio)

/* pb14a_usart0_rxd */
#define PB14A_USART0_RXD \
	SAM_PINMUX(b, 14, a, periph)

/* pb14b_spi_miso */
#define PB14B_SPI_MISO \
	SAM_PINMUX(b, 14, b, periph)

/* pb14c_twim3_twd */
#define PB14C_TWIM3_TWD \
	SAM_PINMUX(b, 14, c, periph)

/* pb14d_tc0_clk1 */
#define PB14D_TC0_CLK1 \
	SAM_PINMUX(b, 14, d, periph)

/* pb14e_scif_gclk_in0 */
#define PB14E_SCIF_GCLK_IN0 \
	SAM_PINMUX(b, 14, e, periph)

/* pb14f_lcdca_seg36 */
#define PB14F_LCDCA_SEG36 \
	SAM_PINMUX(b, 14, f, periph)

/* pb14g_catb_sense1 */
#define PB14G_CATB_SENSE1 \
	SAM_PINMUX(b, 14, g, periph)

/* pb15_gpio */
#define PB15_GPIO \
	SAM_PINMUX(b, 15, gpio, gpio)

/* pb15a_usart0_txd */
#define PB15A_USART0_TXD \
	SAM_PINMUX(b, 15, a, periph)

/* pb15b_spi_mosi */
#define PB15B_SPI_MOSI \
	SAM_PINMUX(b, 15, b, periph)

/* pb15c_twim3_twck */
#define PB15C_TWIM3_TWCK \
	SAM_PINMUX(b, 15, c, periph)

/* pb15d_tc0_clk2 */
#define PB15D_TC0_CLK2 \
	SAM_PINMUX(b, 15, d, periph)

/* pb15e_scif_gclk_in1 */
#define PB15E_SCIF_GCLK_IN1 \
	SAM_PINMUX(b, 15, e, periph)

/* pb15f_lcdca_seg37 */
#define PB15F_LCDCA_SEG37 \
	SAM_PINMUX(b, 15, f, periph)

/* pb15g_catb_sense2 */
#define PB15G_CATB_SENSE2 \
	SAM_PINMUX(b, 15, g, periph)

/* pc0_gpio */
#define PC0_GPIO \
	SAM_PINMUX(c, 0, gpio, gpio)

/* pc0a_spi_npcs2 */
#define PC0A_SPI_NPCS2 \
	SAM_PINMUX(c, 0, a, periph)

/* pc0b_usart0_clk */
#define PC0B_USART0_CLK \
	SAM_PINMUX(c, 0, b, periph)

/* pc0d_tc1_a0 */
#define PC0D_TC1_A0 \
	SAM_PINMUX(c, 0, d, periph)

/* pc0g_catb_sense3 */
#define PC0G_CATB_SENSE3 \
	SAM_PINMUX(c, 0, g, periph)

/* pc1_gpio */
#define PC1_GPIO \
	SAM_PINMUX(c, 1, gpio, gpio)

/* pc1a_spi_npcs3 */
#define PC1A_SPI_NPCS3 \
	SAM_PINMUX(c, 1, a, periph)

/* pc1b_usart0_rts */
#define PC1B_USART0_RTS \
	SAM_PINMUX(c, 1, b, periph)

/* pc1d_tc1_b0 */
#define PC1D_TC1_B0 \
	SAM_PINMUX(c, 1, d, periph)

/* pc1g_catb_sense4 */
#define PC1G_CATB_SENSE4 \
	SAM_PINMUX(c, 1, g, periph)

/* pc2_gpio */
#define PC2_GPIO \
	SAM_PINMUX(c, 2, gpio, gpio)

/* pc2a_spi_npcs1 */
#define PC2A_SPI_NPCS1 \
	SAM_PINMUX(c, 2, a, periph)

/* pc2b_usart0_cts */
#define PC2B_USART0_CTS \
	SAM_PINMUX(c, 2, b, periph)

/* pc2c_usart0_rxd */
#define PC2C_USART0_RXD \
	SAM_PINMUX(c, 2, c, periph)

/* pc2d_tc1_a1 */
#define PC2D_TC1_A1 \
	SAM_PINMUX(c, 2, d, periph)

/* pc2g_catb_sense5 */
#define PC2G_CATB_SENSE5 \
	SAM_PINMUX(c, 2, g, periph)

/* pc3_gpio */
#define PC3_GPIO \
	SAM_PINMUX(c, 3, gpio, gpio)

/* pc3a_spi_npcs0 */
#define PC3A_SPI_NPCS0 \
	SAM_PINMUX(c, 3, a, periph)

/* pc3b_eic_extint5 */
#define PC3B_EIC_EXTINT5 \
	SAM_PINMUX(c, 3, b, periph)

/* pc3c_usart0_txd */
#define PC3C_USART0_TXD \
	SAM_PINMUX(c, 3, c, periph)

/* pc3d_tc1_b1 */
#define PC3D_TC1_B1 \
	SAM_PINMUX(c, 3, d, periph)

/* pc3g_catb_sense6 */
#define PC3G_CATB_SENSE6 \
	SAM_PINMUX(c, 3, g, periph)

/* pc4_gpio */
#define PC4_GPIO \
	SAM_PINMUX(c, 4, gpio, gpio)

/* pc4a_spi_miso */
#define PC4A_SPI_MISO \
	SAM_PINMUX(c, 4, a, periph)

/* pc4b_eic_extint6 */
#define PC4B_EIC_EXTINT6 \
	SAM_PINMUX(c, 4, b, periph)

/* pc4d_tc1_a2 */
#define PC4D_TC1_A2 \
	SAM_PINMUX(c, 4, d, periph)

/* pc4g_catb_sense7 */
#define PC4G_CATB_SENSE7 \
	SAM_PINMUX(c, 4, g, periph)

/* pc5_gpio */
#define PC5_GPIO \
	SAM_PINMUX(c, 5, gpio, gpio)

/* pc5a_spi_mosi */
#define PC5A_SPI_MOSI \
	SAM_PINMUX(c, 5, a, periph)

/* pc5b_eic_extint7 */
#define PC5B_EIC_EXTINT7 \
	SAM_PINMUX(c, 5, b, periph)

/* pc5d_tc1_b2 */
#define PC5D_TC1_B2 \
	SAM_PINMUX(c, 5, d, periph)

/* pc5g_catb_dis */
#define PC5G_CATB_DIS \
	SAM_PINMUX(c, 5, g, periph)

/* pc6_gpio */
#define PC6_GPIO \
	SAM_PINMUX(c, 6, gpio, gpio)

/* pc6a_spi_sck */
#define PC6A_SPI_SCK \
	SAM_PINMUX(c, 6, a, periph)

/* pc6b_eic_extint8 */
#define PC6B_EIC_EXTINT8 \
	SAM_PINMUX(c, 6, b, periph)

/* pc6d_tc1_clk0 */
#define PC6D_TC1_CLK0 \
	SAM_PINMUX(c, 6, d, periph)

/* pc6g_catb_sense8 */
#define PC6G_CATB_SENSE8 \
	SAM_PINMUX(c, 6, g, periph)

/* pc7_gpio */
#define PC7_GPIO \
	SAM_PINMUX(c, 7, gpio, gpio)

/* pc7a_adcife_ad7 */
#define PC7A_ADCIFE_AD7 \
	SAM_PINMUX(c, 7, a, periph)

/* pc7b_usart2_rts */
#define PC7B_USART2_RTS \
	SAM_PINMUX(c, 7, b, periph)

/* pc7c_pevc_evt0 */
#define PC7C_PEVC_EVT0 \
	SAM_PINMUX(c, 7, c, periph)

/* pc7d_tc1_clk1 */
#define PC7D_TC1_CLK1 \
	SAM_PINMUX(c, 7, d, periph)

/* pc7g_catb_sense9 */
#define PC7G_CATB_SENSE9 \
	SAM_PINMUX(c, 7, g, periph)

/* pc8_gpio */
#define PC8_GPIO \
	SAM_PINMUX(c, 8, gpio, gpio)

/* pc8a_adcife_ad8 */
#define PC8A_ADCIFE_AD8 \
	SAM_PINMUX(c, 8, a, periph)

/* pc8b_usart2_clk */
#define PC8B_USART2_CLK \
	SAM_PINMUX(c, 8, b, periph)

/* pc8c_pevc_evt1 */
#define PC8C_PEVC_EVT1 \
	SAM_PINMUX(c, 8, c, periph)

/* pc8d_tc1_clk2 */
#define PC8D_TC1_CLK2 \
	SAM_PINMUX(c, 8, d, periph)

