zephyrproject-rtos/hal_atmel/include/dt-bindings/pinctrl/sam4lcXc-pinctrl.h
/* pc22f_lcdca_seg12 */
#define PC22F_LCDCA_SEG12 \
	SAM_PINMUX(c, 22, f, periph)

/* pc22g_catb_sense23 */
#define PC22G_CATB_SENSE23 \
	SAM_PINMUX(c, 22, g, periph)

/* pc23_gpio */
#define PC23_GPIO \
	SAM_PINMUX(c, 23, gpio, gpio)

/* pc23a_tc1_clk2 */
#define PC23A_TC1_CLK2 \
	SAM_PINMUX(c, 23, a, periph)

/* pc23d_parc_pcen2 */
#define PC23D_PARC_PCEN2 \
	SAM_PINMUX(c, 23, d, periph)

/* pc23f_lcdca_seg13 */
#define PC23F_LCDCA_SEG13 \
	SAM_PINMUX(c, 23, f, periph)

/* pc23g_catb_dis */
#define PC23G_CATB_DIS \
	SAM_PINMUX(c, 23, g, periph)

/* pc24_gpio */
#define PC24_GPIO \
	SAM_PINMUX(c, 24, gpio, gpio)

/* pc24a_usart1_rts */
#define PC24A_USART1_RTS \
	SAM_PINMUX(c, 24, a, periph)

/* pc24b_eic_extint1 */
#define PC24B_EIC_EXTINT1 \
	SAM_PINMUX(c, 24, b, periph)

/* pc24c_pevc_evt0 */
#define PC24C_PEVC_EVT0 \
	SAM_PINMUX(c, 24, c, periph)

/* pc24d_parc_pcdata0 */
#define PC24D_PARC_PCDATA0 \
	SAM_PINMUX(c, 24, d, periph)

/* pc24f_lcdca_seg24 */
#define PC24F_LCDCA_SEG24 \
	SAM_PINMUX(c, 24, f, periph)

/* pc24g_catb_sense24 */
#define PC24G_CATB_SENSE24 \
	SAM_PINMUX(c, 24, g, periph)

/* pc25_gpio */
#define PC25_GPIO \
	SAM_PINMUX(c, 25, gpio, gpio)

/* pc25a_usart1_clk */
#define PC25A_USART1_CLK \
	SAM_PINMUX(c, 25, a, periph)

/* pc25b_eic_extint2 */
#define PC25B_EIC_EXTINT2 \
	SAM_PINMUX(c, 25, b, periph)

/* pc25c_pevc_evt1 */
#define PC25C_PEVC_EVT1 \
	SAM_PINMUX(c, 25, c, periph)

/* pc25d_parc_pcdata1 */
#define PC25D_PARC_PCDATA1 \
	SAM_PINMUX(c, 25, d, periph)

/* pc25f_lcdca_seg25 */
#define PC25F_LCDCA_SEG25 \
	SAM_PINMUX(c, 25, f, periph)

/* pc25g_catb_sense25 */
#define PC25G_CATB_SENSE25 \
	SAM_PINMUX(c, 25, g, periph)

/* pc26_gpio */
#define PC26_GPIO \
	SAM_PINMUX(c, 26, gpio, gpio)

/* pc26a_usart1_rxd */
#define PC26A_USART1_RXD \
	SAM_PINMUX(c, 26, a, periph)

/* pc26b_eic_extint3 */
#define PC26B_EIC_EXTINT3 \
	SAM_PINMUX(c, 26, b, periph)

/* pc26c_pevc_evt2 */
#define PC26C_PEVC_EVT2 \
	SAM_PINMUX(c, 26, c, periph)

/* pc26d_parc_pcdata2 */
#define PC26D_PARC_PCDATA2 \
	SAM_PINMUX(c, 26, d, periph)

/* pc26e_scif_glkc0 */
#define PC26E_SCIF_GLKC0 \
	SAM_PINMUX(c, 26, e, periph)

/* pc26f_lcdca_seg26 */
#define PC26F_LCDCA_SEG26 \
	SAM_PINMUX(c, 26, f, periph)

/* pc26g_catb_sense26 */
#define PC26G_CATB_SENSE26 \
	SAM_PINMUX(c, 26, g, periph)

/* pc27_gpio */
#define PC27_GPIO \
	SAM_PINMUX(c, 27, gpio, gpio)

/* pc27a_usart1_txd */
#define PC27A_USART1_TXD \
	SAM_PINMUX(c, 27, a, periph)

/* pc27b_eic_extint4 */
#define PC27B_EIC_EXTINT4 \
	SAM_PINMUX(c, 27, b, periph)

/* pc27c_pevc_evt3 */
#define PC27C_PEVC_EVT3 \
	SAM_PINMUX(c, 27, c, periph)

/* pc27d_parc_pcdata3 */
#define PC27D_PARC_PCDATA3 \
	SAM_PINMUX(c, 27, d, periph)

/* pc27e_scif_gclk1 */
#define PC27E_SCIF_GCLK1 \
	SAM_PINMUX(c, 27, e, periph)

/* pc27f_lcdca_seg27 */
#define PC27F_LCDCA_SEG27 \
	SAM_PINMUX(c, 27, f, periph)

/* pc27g_catb_sense27 */
#define PC27G_CATB_SENSE27 \
	SAM_PINMUX(c, 27, g, periph)

/* pc28_gpio */
#define PC28_GPIO \
	SAM_PINMUX(c, 28, gpio, gpio)

/* pc28a_usart3_rxd */
#define PC28A_USART3_RXD \
	SAM_PINMUX(c, 28, a, periph)

/* pc28b_spi_miso */
#define PC28B_SPI_MISO \
	SAM_PINMUX(c, 28, b, periph)

/* pc28c_gloc_in4 */
#define PC28C_GLOC_IN4 \
	SAM_PINMUX(c, 28, c, periph)

/* pc28d_parc_pcdata4 */
#define PC28D_PARC_PCDATA4 \
	SAM_PINMUX(c, 28, d, periph)

/* pc28e_scif_gclk2 */
#define PC28E_SCIF_GCLK2 \
	SAM_PINMUX(c, 28, e, periph)

/* pc28f_lcdca_seg28 */
#define PC28F_LCDCA_SEG28 \
	SAM_PINMUX(c, 28, f, periph)

/* pc28g_catb_sense28 */
#define PC28G_CATB_SENSE28 \
	SAM_PINMUX(c, 28, g, periph)

/* pc29_gpio */
#define PC29_GPIO \
	SAM_PINMUX(c, 29, gpio, gpio)

/* pc29a_usart3_txd */
#define PC29A_USART3_TXD \
	SAM_PINMUX(c, 29, a, periph)

/* pc29b_spi_mosi */
#define PC29B_SPI_MOSI \
	SAM_PINMUX(c, 29, b, periph)

/* pc29c_gloc_in5 */
#define PC29C_GLOC_IN5 \
	SAM_PINMUX(c, 29, c, periph)

/* pc29d_parc_pcdata5 */
#define PC29D_PARC_PCDATA5 \
	SAM_PINMUX(c, 29, d, periph)

/* pc29e_scif_gclk3 */
#define PC29E_SCIF_GCLK3 \
	SAM_PINMUX(c, 29, e, periph)

/* pc29f_lcdca_seg29 */
#define PC29F_LCDCA_SEG29 \
	SAM_PINMUX(c, 29, f, periph)

/* pc29g_catb_sense29 */
#define PC29G_CATB_SENSE29 \
	SAM_PINMUX(c, 29, g, periph)

/* pc30_gpio */
#define PC30_GPIO \
	SAM_PINMUX(c, 30, gpio, gpio)

/* pc30a_usart3_rts */
#define PC30A_USART3_RTS \
	SAM_PINMUX(c, 30, a, periph)

/* pc30b_spi_sck */
#define PC30B_SPI_SCK \
	SAM_PINMUX(c, 30, b, periph)

/* pc30c_gloc_in6 */
#define PC30C_GLOC_IN6 \
	SAM_PINMUX(c, 30, c, periph)

/* pc30d_parc_pcdata6 */
#define PC30D_PARC_PCDATA6 \
	SAM_PINMUX(c, 30, d, periph)

/* pc30e_scif_gclk_in0 */
#define PC30E_SCIF_GCLK_IN0 \
	SAM_PINMUX(c, 30, e, periph)

/* pc30f_lcdca_seg30 */
#define PC30F_LCDCA_SEG30 \
	SAM_PINMUX(c, 30, f, periph)

/* pc30g_catb_sense30 */
#define PC30G_CATB_SENSE30 \
	SAM_PINMUX(c, 30, g, periph)

/* pc31_gpio */
#define PC31_GPIO \
	SAM_PINMUX(c, 31, gpio, gpio)

/* pc31a_usart3_clk */
#define PC31A_USART3_CLK \
	SAM_PINMUX(c, 31, a, periph)

/* pc31b_spi_npcs0 */
#define PC31B_SPI_NPCS0 \
	SAM_PINMUX(c, 31, b, periph)

/* pc31c_gloc_out1 */
#define PC31C_GLOC_OUT1 \
	SAM_PINMUX(c, 31, c, periph)

/* pc31d_parc_pcdata7 */
#define PC31D_PARC_PCDATA7 \
	SAM_PINMUX(c, 31, d, periph)

/* pc31e_scif_gclk_in1 */
#define PC31E_SCIF_GCLK_IN1 \
	SAM_PINMUX(c, 31, e, periph)

/* pc31f_lcdca_seg31 */
#define PC31F_LCDCA_SEG31 \
	SAM_PINMUX(c, 31, f, periph)

/* pc31g_catb_sense31 */
#define PC31G_CATB_SENSE31 \
	SAM_PINMUX(c, 31, g, periph)
